var myMap, myPlacemark;

var coordinates = [
    { 'placem'    : [0.2606136753885061,0.06396484375],
      'poly'      : [[0.15625, 0.08251953125], [0.17626953125, 0.13037109375], [0.3558349609375, 0.0810546875], [0.3687744140625, 0.068603515625], [0.3570556640625, 0.038330078125], [0.1668701171875, 0.070556640625]],
      'placemark' : 'img/placemarks/greenland.png',
      'plmSize'   : 153,
      'title'     : 'Гринландия'
  },{ 'placem'    : [0.1263363316385061,0.24658203125],
      'poly'      : [[0.07470703125, 0.27026367187500006], [0.124267578125, 0.29638671875000006], [0.186767578125, 0.3076171875], [0.186279296875, 0.25], [0.1357421875, 0.2421875], [0.08044433593750006, 0.23876953125]],
      'placemark' : 'img/placemarks/lenin_perspekt.png',
      'plmSize'   : 300,
      'title'     : 'Ленинградская перспектива'
  },{ 'placem'    : [0.1785824253885061,0.14453125],
      'poly'      : [[0.1771240234375, 0.146240234375], [0.1910400390625, 0.164794921875], [0.2252197265625, 0.1533203125], [0.2166748046875, 0.126220703125], [0.1805419921875, 0.134521484375]],
      'placemark' : 'img/placemarks/sozvezdie.png',
      'plmSize'   : 139,
      'title'     : 'Созвездие'
  },{ 'placem'    : [0.2064144566385061,0.18017578125],
      'poly'      : [[0.1932373046875, 0.168701171875], [0.2103271484375, 0.19287109375], [0.2362060546875, 0.185546875], [0.2266845703125, 0.158935546875]],
      'placemark' : 'img/placemarks/lastochka.png',
      'plmSize'   : 142,
      'title'     : 'Ласточка'
  },{ 'placem'    : [0.2410824253885061,0.1298828125],
      'poly'      : [[0.233642578125, 0.136962890625], [0.239501953125, 0.15283203125], [0.27734375, 0.138916015625], [0.26806640625, 0.112548828125], [0.23583984375, 0.121826171875]],
      'placemark' : 'img/placemarks/desiatkino.png',
      'plmSize'   : 152,
      'title'     : 'Десяткино'
  },{ 'placem'    : [0.312615628513506,0.1474609375],
      'poly'      : [[0.22900390624999994, 0.1583251953125], [0.23388671874999994, 0.1717529296875], [0.24902343749999994, 0.1737060546875], [0.27734374999999994, 0.2601318359375], [0.30810546874999994, 0.2579345703125], [0.34594726562499994, 0.182373046875], [0.36279296874999994, 0.175537109375], [0.32934570312499994, 0.09375], [0.2733154296875, 0.1094970703125], [0.2838134765625, 0.1385498046875]],
      'placemark' : 'img/placemarks/soln.png',
      'plmSize'   : 148,
      'title'     : 'Солнечный'
  },{ 'placem'    : [0.22374844101350605,0.26953125],
      'poly'      : [[0.2025146484375, 0.23876953125], [0.2242431640625, 0.291259765625], [0.2630615234375, 0.27490234375], [0.2288818359375, 0.22802734375]],
      'placemark' : 'img/placemarks/tri_kita.png',
      'plmSize'   : 136,
      'title'     : 'Три Кита'
  },{ 'placem'    : [0.290154691013506,0.2841796875],
      'poly'      : [[0.27539062500000006, 0.2655029296875001], [0.28320312500000006, 0.2921142578125001], [0.29516601562500006, 0.2969970703125001], [0.31103515625000006, 0.2960205078125001], [0.35375976562500006, 0.2818603515625001], [0.35717773437500006, 0.2752685546875001], [0.34570312500000006, 0.2559814453125001], [0.32348632812500006, 0.2618408203125001], [0.32006835937500006, 0.2515869140625001], [0.31152343750000006, 0.2542724609375001], [0.31201171875000006, 0.2589111328125001], [0.28320312500000006, 0.2618408203125001]],
      'placemark' : 'img/placemarks/viktoria.png',
      'plmSize'   : 140,
      'title'     : 'Виктория'
  },{ 'placem' : [0.381463284763506,0.1513671875],
      'poly'      : [[0.33239746093750006, 0.2252197265625001], [0.36853027343750006, 0.2698974609375001], [0.4161376953125, 0.2288818359375001], [0.4202880859375, 0.1885986328125001], [0.37292480468750006, 0.08166503906250011], [0.33117675781250006, 0.09436035156250011], [0.36682128906250006, 0.1832275390625001], [0.36364746093750006, 0.1920166015625001], [0.33605957031250006, 0.2127685546875001]],
      'inside'    : [[0.36022949218750006, 0.2078857421875001], [0.36877441406250006, 0.2171630859375001], [0.3919677734375, 0.1947021484375001], [0.4039306640625, 0.1942138671875001], [0.4036865234375, 0.1832275390625001], [0.3839111328125, 0.1829833984375001]],
      'placemark' : 'img/placemarks/moi_gorod.png',
      'plmSize'   : 146,
      'title'     : 'Мой город'
  },{ 'placem'    : [0.366814847263506,0.2041015625],
      'poly'      : [[0.36022949218750006, 0.2078857421875001], [0.36877441406250006, 0.2171630859375001], [0.3919677734375, 0.1947021484375001], [0.4039306640625, 0.1942138671875001], [0.4036865234375, 0.1832275390625001], [0.3839111328125, 0.1829833984375001]],
      'placemark' : 'img/placemarks/9_val.png',
      'plmSize'   : 171,
      'title'     : 'Девятый вал'
  },{ 'placem'    : [0.087890625,0.42486328124999995],
      'poly'      : [[0.00146484375,0.4669189453125001], [0.0693359375,0.4835205078125001], [0.1044921875,0.4659423828125001], [0.095458984375,0.4178466796875001], [0.023193359375,0.4293212890625001], [0.005859375,0.4461669921875001]],
      'placemark' : 'img/placemarks/tri9kino.png',
      'plmSize'   : 170,
      'title'     : 'Тридевяткино'
  },{ 'placem'    : [0.17626953125,0.49273437499999995],
      'poly'      : [[0.07666015625,0.4852294921875001], [0.095947265625,0.5655517578125001], [0.1470947265625,0.5757421875], [0.1854248046875,0.5425390625], [0.2340087890625,0.52447265625], [0.2462158203125,0.500302734375], [0.2337646484375,0.47222656249999995], [0.2249755859375,0.47686523437499995], [0.2152099609375,0.48614257812499995], [0.2064208984375,0.49395507812499995], [0.2008056640625,0.49590820312499995], [0.1685791015625,0.47857421874999995], [0.1622314453125,0.47540039062499995], [0.1444091796875,0.46978515624999995], [0.1380615234375,0.46868652343749995], [0.1260986328125,0.46722167968749995], [0.1138916015625,0.46844238281249995], [0.1011962890625,0.47210449218749995], [0.0872802734375,0.47894042968749995]],
      'placemark' : 'img/placemarks/murin_posad.png',
      'plmSize'   : 210,
      'title'     : 'Муринский посад'
  },{ 'placem'    : [0.08740234375,0.63482421875],
      'poly'      : [[0.0826416015625,0.63287109375], [0.0831298828125,0.657041015625], [0.0946044921875,0.656552734375], [0.0946044921875,0.63921875], [0.0911865234375,0.637265625], [0.0904541015625,0.6343359375], [0.0904541015625,0.632626953125]],
      'placemark' : 'img/placemarks/dom_v_novom.png',
      'plmSize'   : 254,
      'title'     : 'Дом в Новом Девяткино'
  },{ 'placem'    : [0.1171875,0.594296875],
      'poly'      : [[0.1055908203125,0.613583984375], [0.1126708984375,0.62359375], [0.1243896484375,0.628720703125], [0.1309814453125,0.58990234375], [0.1112060546875,0.5933203125]],
      'placemark' : 'img/placemarks/podkova.png',
      'plmSize'   : 127,
      'title'     : 'Подкова'
  },{ 'placem'    : [0.1640625,0.62701171875],
      'poly'      : [[0.1246337890625,0.628720703125], [0.1651611328125,0.64751953125], [0.1712646484375,0.636044921875], [0.1785888671875,0.63873046875], [0.1817626953125,0.637509765625], [0.2237548828125,0.559140625], [0.2171630859375,0.55572265625], [0.1954345703125,0.568173828125], [0.1895751953125,0.559384765625], [0.1448974609375,0.5874609375], [0.1312255859375,0.589658203125]],
      'placemark' : 'img/placemarks/9kino.png',
      'plmSize'   : 139,
      'title'     : 'Девяткино'
  },{ 'placem'    : [0.19921875,0.5542578125],
      'poly'      : [[0.1893310546875,0.559384765625], [0.1956787109375,0.567685546875], [0.2166748046875,0.5542578125], [0.2242431640625,0.55767578125], [0.2261962890625,0.55181640625], [0.2135009765625,0.544248046875]],
      'placemark' : 'img/placemarks/fregat.png',
      'plmSize'   : 119,
      'title'     : 'Фрегат'
  },{ 'placem'    : [0.276611328125,0.37261718749999995],
      'poly'      : [[0.26257324218750006,0.39666503906249995], [0.27429199218750006,0.40496582031249995], [0.29016113281250006,0.38592285156249995], [0.30017089843750006,0.38567871093749995], [0.30895996093750006,0.39080566406249995], [0.32263183593750006,0.39080566406249995], [0.32458496093750006,0.38421386718749995], [0.30432128906250006,0.34100097656249995], [0.26745605468750006,0.35223144531249995], [0.27380371093750006,0.37469238281249995]],
      'placemark' : 'img/placemarks/eland.png',
      'plmSize'   : 107,
      'title'     : 'Эланд'
  },{ 'placem'    : [0.325927734375,0.35699218749999995],
      'poly'      : [[0.30639648437500006,0.34124511718749995], [0.32543945312500006,0.38128417968749995], [0.32739257812500006,0.38055175781249995], [0.32958984375000006,0.35589355468749995], [0.35400390625000006,0.34808105468749995], [0.35107421875000006,0.33758300781249995], [0.36059570312500006,0.33416503906249995], [0.35766601562500006,0.32464355468749995]],
      'placemark' : 'img/placemarks/mechta.png',
      'plmSize'   : 115,
      'title'     : 'Мечта'
  },{ 'placem'    : [0.48583984375,0.48150390624999995],
      'poly'      : [[0.483642578125,0.46185058593749995], [0.484130859375,0.48870605468749995], [0.4970703125,0.48895019531249995], [0.4970703125,0.46233886718749995]],
      'placemark' : 'img/placemarks/voronzov.png',
      'plmSize'   : 136,
      'title'     : 'Воронцов'
  },{ 'placem'    : [0.56591796875,0.39800781249999995],
      'poly'      : [[0.5224609375,0.35101074218749995], [0.524658203125,0.36150878906249995], [0.54443359375,0.38152832031249995], [0.559814453125,0.38348144531249995], [0.565185546875,0.40447753906249995], [0.57470703125,0.42498535156249995], [0.58642578125,0.42474121093749995], [0.603759765625,0.47063964843749995], [0.629638671875,0.46136230468749995], [0.63037109375,0.45232910156249995], [0.589111328125,0.35516113281249995], [0.576171875,0.33953613281249995], [0.55517578125,0.32562011718749995]],
      'placemark' : 'img/placemarks/novoe_murino.png',
      'plmSize'   : 180,
      'title'     : 'Новое Мурино'
  },{ 'placem'    : [0.706787109375,0.50787109375],
      'poly'      : [[0.638427734375,0.46893066406249995], [0.701416015625,0.5087255859375], [0.7376708984375,0.5562109375], [0.8466796875000001,0.49541992187499995], [0.88037109375,0.48614257812499995], [0.8857421875,0.45025390624999995], [0.7073974609374993,0.34881347656249995], [0.6618652343749996,0.35564941406249995], [0.6420898437499996,0.41009277343749995]],
      'placemark' : 'img/placemarks/nov_ohta.png',
      'plmSize'   : 159,
      'title'     : 'Новая Охта'
  },];

ymaps.ready(init);

function init() {
    // Создаем проекцию для декартовой системы координат.
    var myProjection = new ymaps.projection.Cartesian([
            // Определяем границы области отображения в декартовых координатах.
            [1, 0],
            [0, 1]
        ]),

    // Создадим собственный слой карты:
        MyLayer = function () {
            return new ymaps.Layer(
                // Зададим функцию, преобразующую номер тайла
                // и уровень масштабировая в URL тайла на сервере.
                function (tile, zoom) {
                  return "img/ymap/" + zoom + "/tile-"+tile[0] + "-"+tile[1]+".jpg";
                }
            );
        };

    // Добавим конструктор слоя в хранилище слоёв под ключом my#layer.
    ymaps.layer.storage.add('my#layer', MyLayer);
    // Создадим новый тип карты, состоящий только из нашего слоя тайлов,
    // и добавим его в хранилище типов карты под ключом my#type.
    ymaps.mapType.storage.add('my#type', new ymaps.MapType(
        'Схема',
        ['my#layer']
    ));

    // Создадим карту в заданной системе координат.
    myMap = new ymaps.Map('map', {
        center:[0, 0],
        zoom:3,
        type:'my#type',
        avoidFractionalZoom: false
    }, {
        maxZoom:4, // Максимальный коэффициент масштабирования для заданной проекции.
        minZoom:3, // Минимальный коэффициент масштабирования.
        projection:myProjection,
        restrictMapArea: [[0, 0], [0.89, 0.69]]
    });

    zoomButton();

    myMap.controls.add(zoomControl, {right: $('#map').outerWidth()/2 - 490, bottom: 0});

    $.each(coordinates, function(index, value) {
        var polygon = getPolygon(value);
        myMap.geoObjects.add(polygon.poly).add(polygon.placem);
    });

    points = [];
  
    // Поставим метку по клику над картой
    myMap.events.add('mousedown', function (e) {
      // var offset = e.get('coordPosition');
      // points.push(offset);
      // console.log("["+points.join('], [')+']');
    });
}

function getPolygon(coord) {
  var myLayout = ymaps.templateLayoutFactory.createClass('<h3 id="test-map-h3">Hello</h3>', {}
          );
  var inside = (typeof coord.inside != 'undefined') ? coord.inside : [];
  var poly = new ymaps.Polygon([
      // Координаты внешнего контура.
      coord.poly,
      inside
  ], {}, {
      fillColor: '#d7725e',
      strokeColor: '#cb624c',
      // Делаем полигон прозрачным для событий карты.
      interactivityModel: 'default#transparent',
      strokeWidth: 2,
      opacity: 0
  });
  var placem = new ymaps.Placemark(coord.placem, {},
    {
        //preset: "twirl#yellowStretchyIcon",
        iconImageHref   : coord.placemark,
        iconImageSize   : [coord.plmSize / 1.5, 62 / 1.5],
        iconImageOffset : [-(coord.plmSize-38) / 1.5, -62 / 1.5],
        // Заставляем балун открываться даже если в нем нет содержимого.
        openEmptyBalloon: true,
        balloonCloseButton: false
        //iconImageHref: 'http://api-maps.yandex.ru/2.0.35/images/f1803ced2e0fe1b1011ad5f040d02219.png'
    });
  poly.events.add('mouseenter', function(e){
    poly.options.set('opacity', '0.5');
  });
  poly.events.add('mouseleave', function(e){
    poly.options.set('opacity', '0');
  });
  poly.events.add('click', function(e){
    placem.balloon.open();
  });
  placem.events.add('mouseenter', function(e){
    poly.options.set('opacity', '0.5');
  });
  placem.events.add('mouseleave', function(e){
    poly.options.set('opacity', '0');
  });
  placem.events.add('balloonopen', function (e) {
    placem.properties.set('balloonContent', '<img src="img/ajax-loader.gif" />');
  });
  return {'poly' : poly, 'placem' : placem};
}

function zoomButton() {
    // Создадим пользовательский макет ползунка масштаба.
    ZoomLayout = ymaps.templateLayoutFactory.createClass('<div class="map_buttons clearfix" id="map_buttons" data-zoom="1">' +
            '<a href="#" class="map_buttons_minus"></a>' +
            '<a href="#" class="map_buttons_plus"></a>' +
        "</div>", {

        // Переопределяем методы макета, чтобы выполнять дополнительные действия
        // при построении и очистке макета.
        build: function () {
            // Вызываем родительский метод build.
            ZoomLayout.superclass.build.call(this);

            // Привязываем функции-обработчики к контексту и сохраняем ссылки
            // на них, чтобы потом отписаться от событий.
            this.zoomInCallback = ymaps.util.bind(this.zoomIn, this);
            this.zoomOutCallback = ymaps.util.bind(this.zoomOut, this);
            
            var self = this;

            // Начинаем слушать клики на кнопках макета.
            $('.map_buttons_plus').bind('click', function(e) {
              e.preventDefault();
              self.zoomInCallback();
            });
            $('.map_buttons_minus').bind('click', function(e) {
              e.preventDefault();
              self.zoomOutCallback();
            })
        },

        clear: function () {
            // Снимаем обработчики кликов.
            $('.map_buttons_plus').unbind('click', this.zoomInCallback);
            $('.map_buttons_minus').unbind('click', this.zoomOutCallback);

            // Вызываем родительский метод clear.
            ZoomLayout.superclass.clear.call(this);
        },

        zoomIn: function () {
            var map = this.getData().control.getMap();
            // Генерируем событие, в ответ на которое
            // элемент управления изменит коэффициент масштабирования карты.
            this.events.fire('zoomchange', {
                oldZoom: map.getZoom(),
                newZoom: map.getZoom() + 1
            });
        },

        zoomOut: function () {
            var map = this.getData().control.getMap();
            this.events.fire('zoomchange', {
                oldZoom: map.getZoom(),
                newZoom: map.getZoom() - 1
            });
        }
    }),

    zoomControl = new ymaps.control.SmallZoomControl({
        layout: ZoomLayout
    });
}